Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/crime_and_crime_prevention/seniors_alert.html.txt.tmx
Source language: en
Languages: ga

source: The Seniors Alert Scheme provides grant support for the supply of equipment to enable older people without sufficient means to continue to live securely in their homes
ga: Cuireann an Scéim Rabhaidh do Sheanóirí tacaíocht deontais ar fáil chun trealamh a sholáthar le cur ar chumas daoine scothaosta nach bhfuil dóthain maoine acu maireachtáil go slán ina gcuid tithe

source: The scheme, which is run by Pobal, replaced the Scheme of Community Support for Older People in May 2010
ga: Tháinig an scéim, atá á reáchtáil ag Pobal, i gcomharba ar an Scéim Tacaíochta Pobail do Dhaoine Scothaosta i mBealtaine 2010

source: The grant assistance is made available through community and voluntary groups registered with Pobal
ga: Cuirtear an cúnamh deontais ar fáil trí ghrúpaí pobail agus deonacha atá cláraithe le Pobal

source: Who is eligible for grant support?
ga: Cé atá incháilithe do chúnamh deontais?

source: The scheme provides assistance to older people
ga: Cuireann an scéim cúnamh ar fáil do dhaoine scothaosta

source: To be eligible you must be:
ga: Chun a bheith incháilithe ní mór duit a bheith:

source: • Aged 65 or over and have limited means or resources
ga: • 65 bliain d'aois nó níos mó agus maoin nó acmhainn theoranta a bheith agat

source: • Living alone or with someone who also meets the eligibility criteria
ga: • Ag maireachtáil i d’aonar nó le duine eile a chomhlíonann na critéir cháilitheachta

source: • Living in the area covered by the community group administering the grant support
ga: • Ag maireachtáil sa cheantar atá á chlúdach ag an ngrúpa pobail atá ag riaradh an chúnaimh deontais

source: • Able to benefit from the equipment being supplied
ga: • Ábalta leas a bhaint as an trealamh a chuirtear ar fáil

source: • Willing to maintain contact with the community group
ga: • Sásta fanacht i dteagmháil leis an ngrúpa pobail

source: What type of equipment can be supplied?
ga: Cén cineál trealaimh is féidir a chur ar fáil?

source: Grant support is provided towards the cost of purchasing and installing monitored personal alarms, as well as additional or replacement pendants
ga: Cuirtear cúnamh deontais ar fáil i dtreo na gcostas a bhaineann le trealamh aláraim phearsanta atá faoi mhonatóireacht a cheannach agus a chur isteach

source: Equipment supplied under the scheme remains the property of the community group
ga: Fanann an trealamh a chuirtear ar fáil faoin scéim faoi úinéireacht an ghrúpa pobail

source: How is an application for a grant made?
ga: Conas a dhéantar iarratas ar dheontas?

source: An application for a grant is made by the registered community group for your area
ga: Déanann an grúpa pobail cláraithe i do cheantar iarratas ar dheontas

source: When a community group identifies an older person in its area as needing assistance, it:
ga: Nuair a aithníonn grúpa pobail duine scothaosta ina gceantar óna dteastaíonn cabhair:

source: • Assesses the person’s eligibility for the scheme and completes the application form
ga: • Déanann sé measúnú ar incháilitheacht an duine don scéim agus comhlánaíonn sé an fhoirm iarratais

source: • Identifies the equipment required and obtains quotations from suppliers
ga: • Aithníonn sé an trealamh a theastaíonn agus faigheann sé luachana ó sholáthróirí

source: • Submits the application with supporting documentation to the Department
ga: • Seolann sé an t iarratas le doiciméid thacaíochta chuig an Roinn

source: Groups can apply for grants all year round
ga: Is féidir le grúpaí iarratas a dhéanamh ar dheontais ar feadh na bliana ar fad

source: What groups can register for the scheme?
ga: Cén sórt grúpaí atá in ann clárú don scéim?

source: Groups wishing to participate in the scheme need to register with Pobal first
ga: Ní mór do ghrúpaí ar mian leo páirt a ghlacadh sa scéim clárú le Pobal ar dtús

source: Community, voluntary and not-for-profit organisations are eligible to register
ga: Tá eagraíochtaí pobail, deonacha agus neamhbhrabúis i dteideal clárú

source: They must have a recognised structure and be able to demonstrate a capability of managing the grants
ga: Ní mór dóibh struchtúr aitheanta a bheith acu agus a bheith ábalta a léiriú go bhfuil an cumas acu na deontais a bhainistiú

source: They must also have a record of working with older people in the community
ga: Ní mór dóibh cuntas teiste a bheith acu ag obair le daoine scothaosta sa phobal freisin

source: A group will not be able to register where there is an existing group operating the scheme in the area
ga: Ní bheidh grúpa ábalta clárú sa chás go bhfuil grúpa i mbun na scéime sa cheantar cheana féin

source: If you feel you may be eligible for grant support you should contact the group registered to operate the scheme in your area
ga: Má cheapann tú go bhféadfá a bheith i dteideal cúnamh deontais a fháil ba chóir duit dul i dteagmháil leis an ngrúpa atá cláraithe chun an scéim a fheidhmiú i do cheantar

source: You can contact Pobal at the address below for contact details
ga: Is féidir leat teagmháil a dhéanamh le Pobal ag an seoladh thíos le haghaidh sonraí teagmhála

source: Pobal has information on groups that are registered (pdf) on its website
ga: Tá faisnéis maidir leis na grúpaí atá cláraithe (pdf) ar shuíomh gréasáin Phobal

source: Pobal does not accept applications from individuals for grant support
ga: Ní ghlacann Pobal le hiarratais ó dhaoine aonair chun cúnamh deontais a fháil

source: Groups wishing to register for the scheme can register online at https://sas.pobal.ie
ga: Ba chóir do ghrúpaí ar mian leo clárú don scéim a chlárú ar líne ag https://sas.pobal.ie

source: Further information on the scheme is available on Pobal’s website
ga: Tá tuilleadh eolais maidir leis an scéim ar fáil ar láithreán gréasáin Phobal

source: Contact the Seniors Alert Scheme section in Pobal at the address below or by email at onlinesupport@pobal.ie for further information
ga: Téigh i dteagmháil leis an alt Scéim Rabhaidh do Sheanóirí sa Phobal ag an seoladh thíos nó trí ríomhphost ag onlinesupport@pobal.ie chun tuilleadh eolais a fháil
